changelog.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Change Log</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-10-07 01:56:21 CEST"/>
<meta name="author" content="Hubert Iwaniuk"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Change Log</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Release 1.2.0 </a>
<ul>
<li><a href="#sec-1_1">1.1 Bug fixes </a>
<ul>
<li><a href="#sec-1_1_1">1.1.1 Wrong import statement cause OSGi to fail </a></li>
<li><a href="#sec-1_1_2">1.1.2 Parameter encoding issue </a></li>
<li><a href="#sec-1_1_3">1.1.3 Connection Pool: Make sure the channel is still open </a></li>
<li><a href="#sec-1_1_4">1.1.4 NettyAsyncProvider optimization: avoid invoking onStatusReceived and onHeadersReceived multiple time per transaction </a></li>
<li><a href="#sec-1_1_5">1.1.5 Do not set a default Content-Type </a></li>
<li><a href="#sec-1_1_6">1.1.6 fix redirect loop issue </a></li>
<li><a href="#sec-1_1_7">1.1.7 NettyAsyncHttpProvider.construct incorrectly appends default port to host header </a></li>
<li><a href="#sec-1_1_8">1.1.8 NettyAsyncHttpProvider.construct allows empty Request-URIs in Request-Line </a></li>
<li><a href="#sec-1_1_9">1.1.9 The current reaper may close connection event if they are active </a></li>
<li><a href="#sec-1_1_10">1.1.10 Escape from redirect loops &amp; allow more urls </a></li>
<li><a href="#sec-1_1_11">1.1.11 Http to Https redirect broken </a></li>
<li><a href="#sec-1_1_12">1.1.12 Mixing secure and not secure connections on a single client causes issues </a></li>
<li><a href="#sec-1_1_13">1.1.13 Support custom HTTP methods </a></li>
<li><a href="#sec-1_1_14">1.1.14 Configurable Connection Pool </a></li>
<li><a href="#sec-1_1_15">1.1.15 NettyAsyncHttpProvider.construct should default to using Accept: <b>/</b> header </a></li>
<li><a href="#sec-1_1_16">1.1.16 AsyncHttpClientConfig.Builder leaks executors </a></li>
<li><a href="#sec-1_1_17">1.1.17 onCompleted may get called twice </a></li>
<li><a href="#sec-1_1_18">1.1.18 Race condition when the remote server close the connection and ConnectionsPool is used </a></li>
<li><a href="#sec-1_1_19">1.1.19 Issue HTTPS tunneling when ProxyServer being set on the AsyncHttpConfig </a></li>
<li><a href="#sec-1_1_20">1.1.20 Infinite redirects on some server because ":80" is appended to host name </a></li>
<li><a href="#sec-1_1_21">1.1.21 Use full url (including host : port ) for request thru proxy </a></li>
<li><a href="#sec-1_1_22">1.1.22 Channel must be closed when idle timeout fires </a></li>
<li><a href="#sec-1_1_23">1.1.23 Per request follow redirects </a></li>
<li><a href="#sec-1_1_24">1.1.24 MaximumConnectionsTotal doesn't work </a></li>
<li><a href="#sec-1_1_25">1.1.25 Fix Idle timeout </a></li>
</ul>
</li>
<li><a href="#sec-1_2">1.2 New features </a>
<ul>
<li><a href="#sec-1_2_1">1.2.1 Add security support to ProxyServer </a></li>
<li><a href="#sec-1_2_2">1.2.2 Add support for zero-copy file upload </a></li>
<li><a href="#sec-1_2_3">1.2.3 Progress callbacks </a></li>
<li><a href="#sec-1_2_4">1.2.4 Add CONNECT support </a></li>
<li><a href="#sec-1_2_5">1.2.5 Add request timeout per request </a></li>
<li><a href="#sec-1_2_6">1.2.6 Add support for zero-copy bytes to ResponseBodyPart </a></li>
<li><a href="#sec-1_2_7">1.2.7 Make Response getter more robust, add helper </a></li>
<li><a href="#sec-1_2_8">1.2.8 Add support for preemptive authentication configuration </a></li>
<li><a href="#sec-1_2_9">1.2.9 Expose ByteBuffer in HttpResponseBodyPart to reduce byte copy </a></li>
<li><a href="#sec-1_2_10">1.2.10 Add support for AsyncProviderConfig object that can be used to configure proprietary properties </a></li>
<li><a href="#sec-1_2_11">1.2.11 SSL failure leaks channel </a></li>
<li><a href="#sec-1_2_12">1.2.12 Repackage the providers/* to providers/netty </a></li>
<li><a href="#sec-1_2_13">1.2.13 Compile with 1.6+ and run with 1.5+ </a></li>
<li><a href="#sec-1_2_14">1.2.14 Add NTLM authentication support </a></li>
<li><a href="#sec-1_2_15">1.2.15 Add WebDav support </a></li>
<li><a href="#sec-1_2_16">1.2.16 Add support for a JDK Provider </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Release 1.2.0 </h2>
<div class="outline-text-2" id="text-1">

<p>This release breaks backward compatibility.
</p>
</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Bug fixes </h3>
<div class="outline-text-3" id="text-1_1">


</div>

<div id="outline-container-1_1_1" class="outline-4">
<h4 id="sec-1_1_1"><span class="section-number-4">1.1.1</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/6">Wrong import statement cause OSGi to fail</a> </h4>
<div class="outline-text-4" id="text-1_1_1">

</div>

</div>

<div id="outline-container-1_1_2" class="outline-4">
<h4 id="sec-1_1_2"><span class="section-number-4">1.1.2</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/10">Parameter encoding issue</a> </h4>
<div class="outline-text-4" id="text-1_1_2">

<p>Test case by <a href="http://github.com/martint">Martin Traverso</a>.
</p></div>

</div>

<div id="outline-container-1_1_3" class="outline-4">
<h4 id="sec-1_1_3"><span class="section-number-4">1.1.3</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/11">Connection Pool: Make sure the channel is still open</a> </h4>
<div class="outline-text-4" id="text-1_1_3">

</div>

</div>

<div id="outline-container-1_1_4" class="outline-4">
<h4 id="sec-1_1_4"><span class="section-number-4">1.1.4</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed/#issue/16">NettyAsyncProvider optimization: avoid invoking onStatusReceived and onHeadersReceived multiple time per transaction</a> </h4>
<div class="outline-text-4" id="text-1_1_4">

</div>

</div>

<div id="outline-container-1_1_5" class="outline-4">
<h4 id="sec-1_1_5"><span class="section-number-4">1.1.5</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed/#issue/17">Do not set a default Content-Type</a> </h4>
<div class="outline-text-4" id="text-1_1_5">

</div>

</div>

<div id="outline-container-1_1_6" class="outline-4">
<h4 id="sec-1_1_6"><span class="section-number-4">1.1.6</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/24">fix redirect loop issue</a> </h4>
<div class="outline-text-4" id="text-1_1_6">

<p><a href="http://github.com/AsyncHttpClient/async-http-client/pull/24">Patch</a> provided by <a href="http://github.com/jloomis">Jenny Loomis</a>.
</p></div>

</div>

<div id="outline-container-1_1_7" class="outline-4">
<h4 id="sec-1_1_7"><span class="section-number-4">1.1.7</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/22">NettyAsyncHttpProvider.construct incorrectly appends default port to host header</a> </h4>
<div class="outline-text-4" id="text-1_1_7">

</div>

</div>

<div id="outline-container-1_1_8" class="outline-4">
<h4 id="sec-1_1_8"><span class="section-number-4">1.1.8</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/21">NettyAsyncHttpProvider.construct allows empty Request-URIs in Request-Line</a> </h4>
<div class="outline-text-4" id="text-1_1_8">

</div>

</div>

<div id="outline-container-1_1_9" class="outline-4">
<h4 id="sec-1_1_9"><span class="section-number-4">1.1.9</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/20">The current reaper may close connection event if they are active</a> </h4>
<div class="outline-text-4" id="text-1_1_9">

</div>

</div>

<div id="outline-container-1_1_10" class="outline-4">
<h4 id="sec-1_1_10"><span class="section-number-4">1.1.10</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/28">Escape from redirect loops &amp; allow more urls</a> </h4>
<div class="outline-text-4" id="text-1_1_10">

<p><a href="http://github.com/AsyncHttpClient/async-http-client/pull/28">Patch</a> provided by <a href="http://github.com/jloomis">Jenny Loomis</a>.
</p></div>

</div>

<div id="outline-container-1_1_11" class="outline-4">
<h4 id="sec-1_1_11"><span class="section-number-4">1.1.11</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/34">Http to Https redirect broken</a> </h4>
<div class="outline-text-4" id="text-1_1_11">

</div>

</div>

<div id="outline-container-1_1_12" class="outline-4">
<h4 id="sec-1_1_12"><span class="section-number-4">1.1.12</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/25">Mixing secure and not secure connections on a single client causes issues</a> </h4>
<div class="outline-text-4" id="text-1_1_12">

</div>

</div>

<div id="outline-container-1_1_13" class="outline-4">
<h4 id="sec-1_1_13"><span class="section-number-4">1.1.13</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/19">Support custom HTTP methods</a> </h4>
<div class="outline-text-4" id="text-1_1_13">

</div>

</div>

<div id="outline-container-1_1_14" class="outline-4">
<h4 id="sec-1_1_14"><span class="section-number-4">1.1.14</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/40">Configurable Connection Pool</a> </h4>
<div class="outline-text-4" id="text-1_1_14">

</div>

</div>

<div id="outline-container-1_1_15" class="outline-4">
<h4 id="sec-1_1_15"><span class="section-number-4">1.1.15</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/23">NettyAsyncHttpProvider.construct should default to using Accept: <b>/</b> header</a> </h4>
<div class="outline-text-4" id="text-1_1_15">

</div>

</div>

<div id="outline-container-1_1_16" class="outline-4">
<h4 id="sec-1_1_16"><span class="section-number-4">1.1.16</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/42">AsyncHttpClientConfig.Builder leaks executors</a> </h4>
<div class="outline-text-4" id="text-1_1_16">

</div>

</div>

<div id="outline-container-1_1_17" class="outline-4">
<h4 id="sec-1_1_17"><span class="section-number-4">1.1.17</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/43">onCompleted may get called twice</a> </h4>
<div class="outline-text-4" id="text-1_1_17">

</div>

</div>

<div id="outline-container-1_1_18" class="outline-4">
<h4 id="sec-1_1_18"><span class="section-number-4">1.1.18</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/44">Race condition when the remote server close the connection and ConnectionsPool is used</a> </h4>
<div class="outline-text-4" id="text-1_1_18">

</div>

</div>

<div id="outline-container-1_1_19" class="outline-4">
<h4 id="sec-1_1_19"><span class="section-number-4">1.1.19</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/47">Issue HTTPS tunneling when ProxyServer being set on the AsyncHttpConfig</a> </h4>
<div class="outline-text-4" id="text-1_1_19">

</div>

</div>

<div id="outline-container-1_1_20" class="outline-4">
<h4 id="sec-1_1_20"><span class="section-number-4">1.1.20</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/31">Infinite redirects on some server because ":80" is appended to host name</a> </h4>
<div class="outline-text-4" id="text-1_1_20">

</div>

</div>

<div id="outline-container-1_1_21" class="outline-4">
<h4 id="sec-1_1_21"><span class="section-number-4">1.1.21</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/51">Use full url (including host : port ) for request thru proxy</a> </h4>
<div class="outline-text-4" id="text-1_1_21">

</div>

</div>

<div id="outline-container-1_1_22" class="outline-4">
<h4 id="sec-1_1_22"><span class="section-number-4">1.1.22</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/49">Channel must be closed when idle timeout fires</a> </h4>
<div class="outline-text-4" id="text-1_1_22">

</div>

</div>

<div id="outline-container-1_1_23" class="outline-4">
<h4 id="sec-1_1_23"><span class="section-number-4">1.1.23</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/30">Per request follow redirects</a> </h4>
<div class="outline-text-4" id="text-1_1_23">

<p><a href="http://github.com/AsyncHttpClient/async-http-client/pull/30">Patch</a> provided by <a href="http://github.com/erwan">Erwan Loisant</a>.
</p></div>

</div>

<div id="outline-container-1_1_24" class="outline-4">
<h4 id="sec-1_1_24"><span class="section-number-4">1.1.24</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/33">MaximumConnectionsTotal doesn't work</a> </h4>
<div class="outline-text-4" id="text-1_1_24">

</div>

</div>

<div id="outline-container-1_1_25" class="outline-4">
<h4 id="sec-1_1_25"><span class="section-number-4">1.1.25</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/29">Fix Idle timeout</a> </h4>
<div class="outline-text-4" id="text-1_1_25">

<p><a href="http://github.com/AsyncHttpClient/async-http-client/commit/15f946584156555c32964bb9cbb30cdf32669e4c">Patch</a> provided by <a href="http://github.com/felixtrepanier">felixtrepanier</a>.
</p></div>
</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> New features </h3>
<div class="outline-text-3" id="text-1_2">


</div>

<div id="outline-container-1_2_1" class="outline-4">
<h4 id="sec-1_2_1"><span class="section-number-4">1.2.1</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/5">Add security support to ProxyServer</a> </h4>
<div class="outline-text-4" id="text-1_2_1">

</div>

</div>

<div id="outline-container-1_2_2" class="outline-4">
<h4 id="sec-1_2_2"><span class="section-number-4">1.2.2</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/7">Add support for zero-copy file upload</a> </h4>
<div class="outline-text-4" id="text-1_2_2">

</div>

</div>

<div id="outline-container-1_2_3" class="outline-4">
<h4 id="sec-1_2_3"><span class="section-number-4">1.2.3</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/8">Progress callbacks</a> </h4>
<div class="outline-text-4" id="text-1_2_3">

</div>

</div>

<div id="outline-container-1_2_4" class="outline-4">
<h4 id="sec-1_2_4"><span class="section-number-4">1.2.4</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/12">Add CONNECT support</a> </h4>
<div class="outline-text-4" id="text-1_2_4">

</div>

</div>

<div id="outline-container-1_2_5" class="outline-4">
<h4 id="sec-1_2_5"><span class="section-number-4">1.2.5</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/13">Add request timeout per request</a> </h4>
<div class="outline-text-4" id="text-1_2_5">

</div>

</div>

<div id="outline-container-1_2_6" class="outline-4">
<h4 id="sec-1_2_6"><span class="section-number-4">1.2.6</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/issue/14">Add support for zero-copy bytes to ResponseBodyPart</a> </h4>
<div class="outline-text-4" id="text-1_2_6">

</div>

</div>

<div id="outline-container-1_2_7" class="outline-4">
<h4 id="sec-1_2_7"><span class="section-number-4">1.2.7</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed/#issue/15">Make Response getter more robust, add helper</a> </h4>
<div class="outline-text-4" id="text-1_2_7">

</div>

</div>

<div id="outline-container-1_2_8" class="outline-4">
<h4 id="sec-1_2_8"><span class="section-number-4">1.2.8</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/32">Add support for preemptive authentication configuration</a> </h4>
<div class="outline-text-4" id="text-1_2_8">

</div>

</div>

<div id="outline-container-1_2_9" class="outline-4">
<h4 id="sec-1_2_9"><span class="section-number-4">1.2.9</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/35">Expose ByteBuffer in HttpResponseBodyPart to reduce byte copy</a> </h4>
<div class="outline-text-4" id="text-1_2_9">

</div>

</div>

<div id="outline-container-1_2_10" class="outline-4">
<h4 id="sec-1_2_10"><span class="section-number-4">1.2.10</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/36">Add support for AsyncProviderConfig object that can be used to configure proprietary properties</a> </h4>
<div class="outline-text-4" id="text-1_2_10">

</div>

</div>

<div id="outline-container-1_2_11" class="outline-4">
<h4 id="sec-1_2_11"><span class="section-number-4">1.2.11</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/37">SSL failure leaks channel</a> </h4>
<div class="outline-text-4" id="text-1_2_11">

<p><a href="http://github.com/AsyncHttpClient/async-http-client/pull/38">Test case</a> and a <a href="http://github.com/AsyncHttpClient/async-http-client/pull/39">fix</a> provided by <a href="http://github.com/mpilquist">Michael Pilquist</a>.
</p></div>

</div>

<div id="outline-container-1_2_12" class="outline-4">
<h4 id="sec-1_2_12"><span class="section-number-4">1.2.12</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/50">Repackage the providers/* to providers/netty</a> </h4>
<div class="outline-text-4" id="text-1_2_12">

</div>

</div>

<div id="outline-container-1_2_13" class="outline-4">
<h4 id="sec-1_2_13"><span class="section-number-4">1.2.13</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/41">Compile with 1.6+ and run with 1.5+</a> </h4>
<div class="outline-text-4" id="text-1_2_13">

</div>

</div>

<div id="outline-container-1_2_14" class="outline-4">
<h4 id="sec-1_2_14"><span class="section-number-4">1.2.14</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/53">Add NTLM authentication support</a> </h4>
<div class="outline-text-4" id="text-1_2_14">

</div>

</div>

<div id="outline-container-1_2_15" class="outline-4">
<h4 id="sec-1_2_15"><span class="section-number-4">1.2.15</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/45">Add WebDav support</a> </h4>
<div class="outline-text-4" id="text-1_2_15">

</div>

</div>

<div id="outline-container-1_2_16" class="outline-4">
<h4 id="sec-1_2_16"><span class="section-number-4">1.2.16</span> <a href="http://github.com/AsyncHttpClient/async-http-client/issues/closed#issue/54">Add support for a JDK Provider</a> </h4>
<div class="outline-text-4" id="text-1_2_16">

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Hubert Iwaniuk
</p>
<p class="date"> Date: 2010-10-07 01:56:21 CEST</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 23</p>
</div>
</div>
</body>
</html>
